_posts/language/2024-06-02-omnivore.html
---
layout: post
title: 单词本：omnivore
tags: [English]
categories: [language]
---
<p>
昨天儿童节，去野生动物园撒野。巧的是，还偶遇了一枚前同事。
</p>

<p>
去动物园的好处很多，可以观赏动物，看看他们的习性，可以健身，昨天就走了
1万 7 千步，还能学知识学英语。比如昨天就学了动物食性的英语单词。
</p>

<p>
动物有肉食性的，也有植食性的，还有杂食性的。比如条纹鬣狗就是杂食性动物。所谓杂食性，就是不偏食，不管是肉还是蔬菜，都能吃。
</p>

<p>
杂食动物英语里是这么写的： omnivore ，形容词为 omnivorous。
</p>

<p>
omnivore 来自拉丁语 omnivorus。
</p>

<p>
omnis 意思是 all ，全部。 vorare 的意思是 devour 吞食 swallow 咽下。合在一起就是全部都吞食的杂食动物。
</p>

<p>
法语英语同源，也是 omnivore 。德语则是 der Allesfresser也用 der
Omnivore。又因为德语区分动物的吃和人的吃，所以杂食的人，则是 der
Allesesser 或 die Allesesserin。
</p>

<p>
形容词杂食的，英语是 omnivorous，法语 omnivore，德语 allesfressend。
</p>

<p>
与 omnivore 相似的其他还有
</p>
<ul class="org-ul">
<li>frugivore 食水果动物</li>
<li>carnivore 食肉动物</li>
<li>granivore 食谷动物</li>
<li>herbivore 食草动物</li>
<li>insectivore 食虫动物</li>
</ul>

<p>
西门子跟 NVIDIA 的合作，利用 Omniverse 构建工业元宇宙和数字孪生。
NVIDIA 的 Omniverse 是一个基于 GPU 实时仿真的 3D 设计协作软件，可以构建工业、能源、流程的数字孪生模型。看来 AI 芯片巨头取这个产品名的意图是想全宇宙的方方面面都通通吞食，确实有气吞山河的壮志了。
</p>
